app/views/events/_event_form.html.erb

SELECT "interests".* FROM "interests"
---
  <%= f.text_field :address %>
<%=f.collection_select :interest_id, Interest.all, :id, :name%>