app/views/events/new.html.erb

SELECT "interests".* FROM "interests"
---
<br>
Interest: <%=f.collection_select :interest_id, Interest.all, :id, :name%>