app/views/interests/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."interest_id" = ?  [["interest_id", 1]]
---
<ul>
  <% @interest.events.each do |event| %>