app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "rkim"], ["LIMIT", 1]]
---
  def current_user
    if @current_user
      @current_user
    else
      @current_user = User.find_by(username: cookies[:current_user])