app/controllers/events_controller.rb

INSERT INTO "events" ("name", "address", "datetime", "host_id", "interest_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)
    if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def update
    @event = Event.find(params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def add_guest_to_event
    @event = Event.find(params[:event_id])