app/controllers/interests_controller.rb

SELECT "interests".* FROM "interests"
---
  def index
    @interests = Interest.all

SELECT  "interests".* FROM "interests" WHERE "interests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @interest = Interest.find(params[:id])