app/controllers/users_controller.rb

INSERT INTO "users" ("username", "name", "email", "points", "age", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "age" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["age", 25], ["password_digest", "$2a$10$mBQMX6ToC8BQwT/T.kKw9u3MCtIBdU8816dNiKYtJEW9YTdUvKmCe"], ["updated_at", "2019-01-04 17:25:10.885522"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)