app/models/user.rb

UPDATE "users" SET "points" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["points", 100], ["updated_at", "2019-01-04 03:43:15.051717"], ["id", 2]]
---
  def add_points
    self.update_attribute(:points, 100)

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "events_guests".* FROM "events_guests"
---
  def events_user_is_attending
    eventsguests = EventsGuest.all.select {|x| x.guest_id == self.id }
    eventsguests.collect {|x| x.event }